Part 1: Design an ERD

![png](ERD_book.png)

Part 2: Create the database in Python

In [1]:
pip install sqlalchemy_utils

Requirement already satisfied: sqlalchemy_utils in c:\users\21655\anaconda3\lib\site-packages (0.41.1)
Requirement already satisfied: SQLAlchemy>=1.3 in c:\users\21655\anaconda3\lib\site-packages (from sqlalchemy_utils) (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\21655\anaconda3\lib\site-packages (from SQLAlchemy>=1.3->sqlalchemy_utils) (1.0.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pymysql
pymysql.install_as_MySQLdb()

In [3]:
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [8]:
username = "root"
password = "PASS"
db_name = "books_db"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [9]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/books_db)

In [10]:
create_database(connection)

In [11]:
database_exists(connection)

True

In [37]:
import pandas as pd
df1 = pd.read_csv("Downloads\data (5).csv")
df1.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [38]:
df1.to_sql('users', engine, index=False)

In [39]:
df2 = pd.read_csv("Downloads\data (6).csv")
df2.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [40]:
df2.to_sql('books', engine, index=False)

In [41]:
df3 = pd.read_csv("Downloads\data (7).csv")
df3.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [42]:
df3.to_sql('authors', engine, index=False)

In [43]:
df4 = pd.read_csv("Downloads\data (8).csv")
df4.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [44]:
df4.to_sql('favorites', engine, index=False)

In [45]:
q="""SHOW TABLES FROM books_db"""
pd.read_sql(q, engine)

  Tables_in_books_db
0            authors
1              books
2          favorites
3              users

In [46]:
q="""SELECT 
        b.title, 
        f.user_id
     FROM books b
     JOIN favorites f 
         ON b.id = f.book_id
     WHERE f.user_id = (
                SELECT users.id 
                FROM users 
                WHERE (users.last_name = "Doe" AND users.first_name = "John")) """
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1